{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 2000, 4], "name": "input_part", "sparse": false}, "inbound_nodes": [], "name": "input_part"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_0_frozen", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 60, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [6]}, "inbound_nodes": [[["input_part", 0, 0, {}]]], "name": "conv_0_frozen"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_1_frozen", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [6]}, "inbound_nodes": [[["input_part", 0, 0, {}]]], "name": "conv_1_frozen"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv_0_frozen", 0, 0, {}]]], "name": "batch_normalization_5"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv_1_frozen", 0, 0, {}]]], "name": "batch_normalization_6"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "activation_5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_3"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "permute_3"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_5"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "permute_5"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [16]}, "inbound_nodes": [[["input_part", 0, 0, {}]]], "name": "conv_0"}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "data_format": "channels_last", "pool_size": [60], "padding": "same", "strides": [60]}, "inbound_nodes": [[["permute_3", 0, 0, {}]]], "name": "max_pooling1d_2"}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_3", "trainable": true, "data_format": "channels_last", "pool_size": [32], "padding": "same", "strides": [32]}, "inbound_nodes": [[["permute_5", 0, 0, {}]]], "name": "max_pooling1d_3"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv_0", 0, 0, {}]]], "name": "batch_normalization_7"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_4"}, "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]], "name": "permute_4"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_6"}, "inbound_nodes": [[["max_pooling1d_3", 0, 0, {}]]], "name": "permute_6"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "activation_7"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_2", "axis": -1}, "inbound_nodes": [[["permute_4", 0, 0, {}], ["permute_6", 0, 0, {}], ["activation_7", 0, 0, {}]]], "name": "concatenate_2"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_1_tanh_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "dilated_conv_1_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_1_sigm_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "dilated_conv_1_sigm_s0"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "gated_activation_0_s0"}, "inbound_nodes": [[["dilated_conv_1_tanh_s0", 0, 0, {}], ["dilated_conv_1_sigm_s0", 0, 0, {}]]], "name": "gated_activation_0_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_43", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_0_s0", 0, 0, {}]]], "name": "conv1d_43"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_22"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}], ["conv1d_43", 0, 0, {}]]], "name": "add_22"}, {"class_name": "Dropout", "config": {"rate": 0.00209297445501, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_22"}, "inbound_nodes": [[["add_22", 0, 0, {}]]], "name": "dropout_22"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_2_tanh_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [2], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_22", 0, 0, {}]]], "name": "dilated_conv_2_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_2_sigm_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [2], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_22", 0, 0, {}]]], "name": "dilated_conv_2_sigm_s0"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "gated_activation_1_s0"}, "inbound_nodes": [[["dilated_conv_2_tanh_s0", 0, 0, {}], ["dilated_conv_2_sigm_s0", 0, 0, {}]]], "name": "gated_activation_1_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_45", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_1_s0", 0, 0, {}]]], "name": "conv1d_45"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_23"}, "inbound_nodes": [[["dropout_22", 0, 0, {}], ["conv1d_45", 0, 0, {}]]], "name": "add_23"}, {"class_name": "Dropout", "config": {"rate": 0.00209297445501, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_23"}, "inbound_nodes": [[["add_23", 0, 0, {}]]], "name": "dropout_23"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_4_tanh_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [4], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_23", 0, 0, {}]]], "name": "dilated_conv_4_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_4_sigm_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [4], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_23", 0, 0, {}]]], "name": "dilated_conv_4_sigm_s0"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "gated_activation_2_s0"}, "inbound_nodes": [[["dilated_conv_4_tanh_s0", 0, 0, {}], ["dilated_conv_4_sigm_s0", 0, 0, {}]]], "name": "gated_activation_2_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_47", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_2_s0", 0, 0, {}]]], "name": "conv1d_47"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_24"}, "inbound_nodes": [[["dropout_23", 0, 0, {}], ["conv1d_47", 0, 0, {}]]], "name": "add_24"}, {"class_name": "Dropout", "config": {"rate": 0.00209297445501, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_24"}, "inbound_nodes": [[["add_24", 0, 0, {}]]], "name": "dropout_24"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_8_tanh_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [8], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_24", 0, 0, {}]]], "name": "dilated_conv_8_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_8_sigm_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [8], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_24", 0, 0, {}]]], "name": "dilated_conv_8_sigm_s0"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "gated_activation_3_s0"}, "inbound_nodes": [[["dilated_conv_8_tanh_s0", 0, 0, {}], ["dilated_conv_8_sigm_s0", 0, 0, {}]]], "name": "gated_activation_3_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_49", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_3_s0", 0, 0, {}]]], "name": "conv1d_49"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_25"}, "inbound_nodes": [[["dropout_24", 0, 0, {}], ["conv1d_49", 0, 0, {}]]], "name": "add_25"}, {"class_name": "Dropout", "config": {"rate": 0.00209297445501, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_25"}, "inbound_nodes": [[["add_25", 0, 0, {}]]], "name": "dropout_25"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_16_tanh_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [16], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_25", 0, 0, {}]]], "name": "dilated_conv_16_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_16_sigm_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [16], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_25", 0, 0, {}]]], "name": "dilated_conv_16_sigm_s0"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "gated_activation_4_s0"}, "inbound_nodes": [[["dilated_conv_16_tanh_s0", 0, 0, {}], ["dilated_conv_16_sigm_s0", 0, 0, {}]]], "name": "gated_activation_4_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_51", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_4_s0", 0, 0, {}]]], "name": "conv1d_51"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_26"}, "inbound_nodes": [[["dropout_25", 0, 0, {}], ["conv1d_51", 0, 0, {}]]], "name": "add_26"}, {"class_name": "Dropout", "config": {"rate": 0.00209297445501, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_26"}, "inbound_nodes": [[["add_26", 0, 0, {}]]], "name": "dropout_26"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_32_tanh_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [32], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_26", 0, 0, {}]]], "name": "dilated_conv_32_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_32_sigm_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [32], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_26", 0, 0, {}]]], "name": "dilated_conv_32_sigm_s0"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "gated_activation_5_s0"}, "inbound_nodes": [[["dilated_conv_32_tanh_s0", 0, 0, {}], ["dilated_conv_32_sigm_s0", 0, 0, {}]]], "name": "gated_activation_5_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_53", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_5_s0", 0, 0, {}]]], "name": "conv1d_53"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_27"}, "inbound_nodes": [[["dropout_26", 0, 0, {}], ["conv1d_53", 0, 0, {}]]], "name": "add_27"}, {"class_name": "Dropout", "config": {"rate": 0.00209297445501, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_27"}, "inbound_nodes": [[["add_27", 0, 0, {}]]], "name": "dropout_27"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_64_tanh_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [64], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_27", 0, 0, {}]]], "name": "dilated_conv_64_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_64_sigm_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [64], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_27", 0, 0, {}]]], "name": "dilated_conv_64_sigm_s0"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "gated_activation_6_s0"}, "inbound_nodes": [[["dilated_conv_64_tanh_s0", 0, 0, {}], ["dilated_conv_64_sigm_s0", 0, 0, {}]]], "name": "gated_activation_6_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_55", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_6_s0", 0, 0, {}]]], "name": "conv1d_55"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_28"}, "inbound_nodes": [[["dropout_27", 0, 0, {}], ["conv1d_55", 0, 0, {}]]], "name": "add_28"}, {"class_name": "Dropout", "config": {"rate": 0.00209297445501, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_28"}, "inbound_nodes": [[["add_28", 0, 0, {}]]], "name": "dropout_28"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_128_tanh_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [128], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_28", 0, 0, {}]]], "name": "dilated_conv_128_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_128_sigm_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [128], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_28", 0, 0, {}]]], "name": "dilated_conv_128_sigm_s0"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "gated_activation_7_s0"}, "inbound_nodes": [[["dilated_conv_128_tanh_s0", 0, 0, {}], ["dilated_conv_128_sigm_s0", 0, 0, {}]]], "name": "gated_activation_7_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_57", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_7_s0", 0, 0, {}]]], "name": "conv1d_57"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_29"}, "inbound_nodes": [[["dropout_28", 0, 0, {}], ["conv1d_57", 0, 0, {}]]], "name": "add_29"}, {"class_name": "Dropout", "config": {"rate": 0.00209297445501, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_29"}, "inbound_nodes": [[["add_29", 0, 0, {}]]], "name": "dropout_29"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_256_tanh_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [256], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_29", 0, 0, {}]]], "name": "dilated_conv_256_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_256_sigm_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [256], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_29", 0, 0, {}]]], "name": "dilated_conv_256_sigm_s0"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "gated_activation_8_s0"}, "inbound_nodes": [[["dilated_conv_256_tanh_s0", 0, 0, {}], ["dilated_conv_256_sigm_s0", 0, 0, {}]]], "name": "gated_activation_8_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_59", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_8_s0", 0, 0, {}]]], "name": "conv1d_59"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_30"}, "inbound_nodes": [[["dropout_29", 0, 0, {}], ["conv1d_59", 0, 0, {}]]], "name": "add_30"}, {"class_name": "Dropout", "config": {"rate": 0.00209297445501, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_30"}, "inbound_nodes": [[["add_30", 0, 0, {}]]], "name": "dropout_30"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_512_tanh_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [512], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_30", 0, 0, {}]]], "name": "dilated_conv_512_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_512_sigm_s0", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [512], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_30", 0, 0, {}]]], "name": "dilated_conv_512_sigm_s0"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "gated_activation_9_s0"}, "inbound_nodes": [[["dilated_conv_512_tanh_s0", 0, 0, {}], ["dilated_conv_512_sigm_s0", 0, 0, {}]]], "name": "gated_activation_9_s0"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_61", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_9_s0", 0, 0, {}]]], "name": "conv1d_61"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_31"}, "inbound_nodes": [[["dropout_30", 0, 0, {}], ["conv1d_61", 0, 0, {}]]], "name": "add_31"}, {"class_name": "Dropout", "config": {"rate": 0.00209297445501, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_31"}, "inbound_nodes": [[["add_31", 0, 0, {}]]], "name": "dropout_31"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_1_tanh_s1", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_31", 0, 0, {}]]], "name": "dilated_conv_1_tanh_s1"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_1_sigm_s1", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_31", 0, 0, {}]]], "name": "dilated_conv_1_sigm_s1"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "gated_activation_0_s1"}, "inbound_nodes": [[["dilated_conv_1_tanh_s1", 0, 0, {}], ["dilated_conv_1_sigm_s1", 0, 0, {}]]], "name": "gated_activation_0_s1"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_63", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_0_s1", 0, 0, {}]]], "name": "conv1d_63"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_32"}, "inbound_nodes": [[["dropout_31", 0, 0, {}], ["conv1d_63", 0, 0, {}]]], "name": "add_32"}, {"class_name": "Dropout", "config": {"rate": 0.00209297445501, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_32"}, "inbound_nodes": [[["add_32", 0, 0, {}]]], "name": "dropout_32"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_2_tanh_s1", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [2], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_32", 0, 0, {}]]], "name": "dilated_conv_2_tanh_s1"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_2_sigm_s1", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [2], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_32", 0, 0, {}]]], "name": "dilated_conv_2_sigm_s1"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "gated_activation_1_s1"}, "inbound_nodes": [[["dilated_conv_2_tanh_s1", 0, 0, {}], ["dilated_conv_2_sigm_s1", 0, 0, {}]]], "name": "gated_activation_1_s1"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_65", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_1_s1", 0, 0, {}]]], "name": "conv1d_65"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_33"}, "inbound_nodes": [[["dropout_32", 0, 0, {}], ["conv1d_65", 0, 0, {}]]], "name": "add_33"}, {"class_name": "Dropout", "config": {"rate": 0.00209297445501, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_33"}, "inbound_nodes": [[["add_33", 0, 0, {}]]], "name": "dropout_33"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_4_tanh_s1", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [4], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_33", 0, 0, {}]]], "name": "dilated_conv_4_tanh_s1"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_4_sigm_s1", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [4], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_33", 0, 0, {}]]], "name": "dilated_conv_4_sigm_s1"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "gated_activation_2_s1"}, "inbound_nodes": [[["dilated_conv_4_tanh_s1", 0, 0, {}], ["dilated_conv_4_sigm_s1", 0, 0, {}]]], "name": "gated_activation_2_s1"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_67", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_2_s1", 0, 0, {}]]], "name": "conv1d_67"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_34"}, "inbound_nodes": [[["dropout_33", 0, 0, {}], ["conv1d_67", 0, 0, {}]]], "name": "add_34"}, {"class_name": "Dropout", "config": {"rate": 0.00209297445501, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_34"}, "inbound_nodes": [[["add_34", 0, 0, {}]]], "name": "dropout_34"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_8_tanh_s1", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [8], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_34", 0, 0, {}]]], "name": "dilated_conv_8_tanh_s1"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_8_sigm_s1", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [8], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_34", 0, 0, {}]]], "name": "dilated_conv_8_sigm_s1"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "gated_activation_3_s1"}, "inbound_nodes": [[["dilated_conv_8_tanh_s1", 0, 0, {}], ["dilated_conv_8_sigm_s1", 0, 0, {}]]], "name": "gated_activation_3_s1"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_69", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_3_s1", 0, 0, {}]]], "name": "conv1d_69"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_35"}, "inbound_nodes": [[["dropout_34", 0, 0, {}], ["conv1d_69", 0, 0, {}]]], "name": "add_35"}, {"class_name": "Dropout", "config": {"rate": 0.00209297445501, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_35"}, "inbound_nodes": [[["add_35", 0, 0, {}]]], "name": "dropout_35"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_16_tanh_s1", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [16], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_35", 0, 0, {}]]], "name": "dilated_conv_16_tanh_s1"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_16_sigm_s1", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [16], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_35", 0, 0, {}]]], "name": "dilated_conv_16_sigm_s1"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "gated_activation_4_s1"}, "inbound_nodes": [[["dilated_conv_16_tanh_s1", 0, 0, {}], ["dilated_conv_16_sigm_s1", 0, 0, {}]]], "name": "gated_activation_4_s1"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_71", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_4_s1", 0, 0, {}]]], "name": "conv1d_71"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_36"}, "inbound_nodes": [[["dropout_35", 0, 0, {}], ["conv1d_71", 0, 0, {}]]], "name": "add_36"}, {"class_name": "Dropout", "config": {"rate": 0.00209297445501, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_36"}, "inbound_nodes": [[["add_36", 0, 0, {}]]], "name": "dropout_36"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_32_tanh_s1", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [32], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_36", 0, 0, {}]]], "name": "dilated_conv_32_tanh_s1"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_32_sigm_s1", "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1], "dilation_rate": [32], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 5.259489989839494e-05, "l1": 0.0}}, "filters": 34, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_36", 0, 0, {}]]], "name": "dilated_conv_32_sigm_s1"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "gated_activation_5_s1"}, "inbound_nodes": [[["dilated_conv_32_tanh_s1", 0, 0, {}], 