{"class_name": "Model", "keras_version": "2.3.1", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 5000, 4], "name": "input_part", "sparse": false}, "inbound_nodes": [], "name": "input_part"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_0_pretrained", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 256, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [6]}, "inbound_nodes": [[["input_part", 0, 0, {}]]], "name": "conv_0_pretrained"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 256, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [16]}, "inbound_nodes": [[["input_part", 0, 0, {}]]], "name": "conv_0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv_0_pretrained", 0, 0, {}]]], "name": "batch_normalization_1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "dtype": "float32", "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": -1, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["conv_0", 0, 0, {}]]], "name": "batch_normalization_2"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "Permute", "config": {"dtype": "float32", "trainable": true, "name": "permute_1", "dims": [2, 1]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "permute_1"}, {"class_name": "Permute", "config": {"dtype": "float32", "trainable": true, "name": "permute_3", "dims": [2, 1]}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "permute_3"}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [256], "padding": "same", "strides": [256]}, "inbound_nodes": [[["permute_1", 0, 0, {}]]], "name": "max_pooling1d_1"}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [256], "padding": "same", "strides": [256]}, "inbound_nodes": [[["permute_3", 0, 0, {}]]], "name": "max_pooling1d_2"}, {"class_name": "Permute", "config": {"dtype": "float32", "trainable": true, "name": "permute_2", "dims": [2, 1]}, "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]], "name": "permute_2"}, {"class_name": "Permute", "config": {"dtype": "float32", "trainable": true, "name": "permute_4", "dims": [2, 1]}, "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]], "name": "permute_4"}, {"class_name": "Concatenate", "config": {"dtype": "float32", "trainable": true, "name": "concatenate_1", "axis": -1}, "inbound_nodes": [[["permute_2", 0, 0, {}], ["permute_4", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_1_tanh_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "dilated_conv_1_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_1_sigm_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "dilated_conv_1_sigm_s0"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "gated_activation_0_s0"}, "inbound_nodes": [[["dilated_conv_1_tanh_s0", 0, 0, {}], ["dilated_conv_1_sigm_s0", 0, 0, {}]]], "name": "gated_activation_0_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_0_s0", 0, 0, {}]]], "name": "conv1d_1"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_1"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}], ["conv1d_1", 0, 0, {}]]], "name": "add_1"}, {"class_name": "Dropout", "config": {"name": "dropout_1", "dtype": "float32", "trainable": true, "rate": 0.020166839016, "seed": null, "noise_shape": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_2_tanh_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [2], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dilated_conv_2_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_2_sigm_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [2], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dilated_conv_2_sigm_s0"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "gated_activation_1_s0"}, "inbound_nodes": [[["dilated_conv_2_tanh_s0", 0, 0, {}], ["dilated_conv_2_sigm_s0", 0, 0, {}]]], "name": "gated_activation_1_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_1_s0", 0, 0, {}]]], "name": "conv1d_3"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_2"}, "inbound_nodes": [[["dropout_1", 0, 0, {}], ["conv1d_3", 0, 0, {}]]], "name": "add_2"}, {"class_name": "Dropout", "config": {"name": "dropout_2", "dtype": "float32", "trainable": true, "rate": 0.020166839016, "seed": null, "noise_shape": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_4_tanh_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [4], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dilated_conv_4_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_4_sigm_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [4], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dilated_conv_4_sigm_s0"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "gated_activation_2_s0"}, "inbound_nodes": [[["dilated_conv_4_tanh_s0", 0, 0, {}], ["dilated_conv_4_sigm_s0", 0, 0, {}]]], "name": "gated_activation_2_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_2_s0", 0, 0, {}]]], "name": "conv1d_5"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_3"}, "inbound_nodes": [[["dropout_2", 0, 0, {}], ["conv1d_5", 0, 0, {}]]], "name": "add_3"}, {"class_name": "Dropout", "config": {"name": "dropout_3", "dtype": "float32", "trainable": true, "rate": 0.020166839016, "seed": null, "noise_shape": null}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "dropout_3"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_8_tanh_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [8], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "dilated_conv_8_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_8_sigm_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [8], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "dilated_conv_8_sigm_s0"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "gated_activation_3_s0"}, "inbound_nodes": [[["dilated_conv_8_tanh_s0", 0, 0, {}], ["dilated_conv_8_sigm_s0", 0, 0, {}]]], "name": "gated_activation_3_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_7", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_3_s0", 0, 0, {}]]], "name": "conv1d_7"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_4"}, "inbound_nodes": [[["dropout_3", 0, 0, {}], ["conv1d_7", 0, 0, {}]]], "name": "add_4"}, {"class_name": "Dropout", "config": {"name": "dropout_4", "dtype": "float32", "trainable": true, "rate": 0.020166839016, "seed": null, "noise_shape": null}, "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "dropout_4"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_16_tanh_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [16], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "dilated_conv_16_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_16_sigm_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [16], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "dilated_conv_16_sigm_s0"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "gated_activation_4_s0"}, "inbound_nodes": [[["dilated_conv_16_tanh_s0", 0, 0, {}], ["dilated_conv_16_sigm_s0", 0, 0, {}]]], "name": "gated_activation_4_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_9", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_4_s0", 0, 0, {}]]], "name": "conv1d_9"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_5"}, "inbound_nodes": [[["dropout_4", 0, 0, {}], ["conv1d_9", 0, 0, {}]]], "name": "add_5"}, {"class_name": "Dropout", "config": {"name": "dropout_5", "dtype": "float32", "trainable": true, "rate": 0.020166839016, "seed": null, "noise_shape": null}, "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "dropout_5"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_32_tanh_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [32], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "name": "dilated_conv_32_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_32_sigm_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [32], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "name": "dilated_conv_32_sigm_s0"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "gated_activation_5_s0"}, "inbound_nodes": [[["dilated_conv_32_tanh_s0", 0, 0, {}], ["dilated_conv_32_sigm_s0", 0, 0, {}]]], "name": "gated_activation_5_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_11", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_5_s0", 0, 0, {}]]], "name": "conv1d_11"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_6"}, "inbound_nodes": [[["dropout_5", 0, 0, {}], ["conv1d_11", 0, 0, {}]]], "name": "add_6"}, {"class_name": "Dropout", "config": {"name": "dropout_6", "dtype": "float32", "trainable": true, "rate": 0.020166839016, "seed": null, "noise_shape": null}, "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "dropout_6"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_64_tanh_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [64], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "name": "dilated_conv_64_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_64_sigm_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [64], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "name": "dilated_conv_64_sigm_s0"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "gated_activation_6_s0"}, "inbound_nodes": [[["dilated_conv_64_tanh_s0", 0, 0, {}], ["dilated_conv_64_sigm_s0", 0, 0, {}]]], "name": "gated_activation_6_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_13", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_6_s0", 0, 0, {}]]], "name": "conv1d_13"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_7"}, "inbound_nodes": [[["dropout_6", 0, 0, {}], ["conv1d_13", 0, 0, {}]]], "name": "add_7"}, {"class_name": "Dropout", "config": {"name": "dropout_7", "dtype": "float32", "trainable": true, "rate": 0.020166839016, "seed": null, "noise_shape": null}, "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "dropout_7"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_128_tanh_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [128], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "name": "dilated_conv_128_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_128_sigm_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [128], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "name": "dilated_conv_128_sigm_s0"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "gated_activation_7_s0"}, "inbound_nodes": [[["dilated_conv_128_tanh_s0", 0, 0, {}], ["dilated_conv_128_sigm_s0", 0, 0, {}]]], "name": "gated_activation_7_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_15", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_7_s0", 0, 0, {}]]], "name": "conv1d_15"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_8"}, "inbound_nodes": [[["dropout_7", 0, 0, {}], ["conv1d_15", 0, 0, {}]]], "name": "add_8"}, {"class_name": "Dropout", "config": {"name": "dropout_8", "dtype": "float32", "trainable": true, "rate": 0.020166839016, "seed": null, "noise_shape": null}, "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "dropout_8"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_256_tanh_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [256], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "name": "dilated_conv_256_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_256_sigm_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [256], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "name": "dilated_conv_256_sigm_s0"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "gated_activation_8_s0"}, "inbound_nodes": [[["dilated_conv_256_tanh_s0", 0, 0, {}], ["dilated_conv_256_sigm_s0", 0, 0, {}]]], "name": "gated_activation_8_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_17", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_8_s0", 0, 0, {}]]], "name": "conv1d_17"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_9"}, "inbound_nodes": [[["dropout_8", 0, 0, {}], ["conv1d_17", 0, 0, {}]]], "name": "add_9"}, {"class_name": "Dropout", "config": {"name": "dropout_9", "dtype": "float32", "trainable": true, "rate": 0.020166839016, "seed": null, "noise_shape": null}, "inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "dropout_9"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_512_tanh_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [512], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "name": "dilated_conv_512_tanh_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_512_sigm_s0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [512], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "name": "dilated_conv_512_sigm_s0"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "gated_activation_9_s0"}, "inbound_nodes": [[["dilated_conv_512_tanh_s0", 0, 0, {}], ["dilated_conv_512_sigm_s0", 0, 0, {}]]], "name": "gated_activation_9_s0"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_19", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_9_s0", 0, 0, {}]]], "name": "conv1d_19"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_10"}, "inbound_nodes": [[["dropout_9", 0, 0, {}], ["conv1d_19", 0, 0, {}]]], "name": "add_10"}, {"class_name": "Dropout", "config": {"name": "dropout_10", "dtype": "float32", "trainable": true, "rate": 0.020166839016, "seed": null, "noise_shape": null}, "inbound_nodes": [[["add_10", 0, 0, {}]]], "name": "dropout_10"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_1_tanh_s1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_10", 0, 0, {}]]], "name": "dilated_conv_1_tanh_s1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_1_sigm_s1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_10", 0, 0, {}]]], "name": "dilated_conv_1_sigm_s1"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "gated_activation_0_s1"}, "inbound_nodes": [[["dilated_conv_1_tanh_s1", 0, 0, {}], ["dilated_conv_1_sigm_s1", 0, 0, {}]]], "name": "gated_activation_0_s1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_21", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_0_s1", 0, 0, {}]]], "name": "conv1d_21"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_11"}, "inbound_nodes": [[["dropout_10", 0, 0, {}], ["conv1d_21", 0, 0, {}]]], "name": "add_11"}, {"class_name": "Dropout", "config": {"name": "dropout_11", "dtype": "float32", "trainable": true, "rate": 0.020166839016, "seed": null, "noise_shape": null}, "inbound_nodes": [[["add_11", 0, 0, {}]]], "name": "dropout_11"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_2_tanh_s1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [2], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_11", 0, 0, {}]]], "name": "dilated_conv_2_tanh_s1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_2_sigm_s1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [2], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_11", 0, 0, {}]]], "name": "dilated_conv_2_sigm_s1"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "gated_activation_1_s1"}, "inbound_nodes": [[["dilated_conv_2_tanh_s1", 0, 0, {}], ["dilated_conv_2_sigm_s1", 0, 0, {}]]], "name": "gated_activation_1_s1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_23", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_1_s1", 0, 0, {}]]], "name": "conv1d_23"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_12"}, "inbound_nodes": [[["dropout_11", 0, 0, {}], ["conv1d_23", 0, 0, {}]]], "name": "add_12"}, {"class_name": "Dropout", "config": {"name": "dropout_12", "dtype": "float32", "trainable": true, "rate": 0.020166839016, "seed": null, "noise_shape": null}, "inbound_nodes": [[["add_12", 0, 0, {}]]], "name": "dropout_12"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_4_tanh_s1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [4], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_12", 0, 0, {}]]], "name": "dilated_conv_4_tanh_s1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_4_sigm_s1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [4], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_12", 0, 0, {}]]], "name": "dilated_conv_4_sigm_s1"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "gated_activation_2_s1"}, "inbound_nodes": [[["dilated_conv_4_tanh_s1", 0, 0, {}], ["dilated_conv_4_sigm_s1", 0, 0, {}]]], "name": "gated_activation_2_s1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_25", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_2_s1", 0, 0, {}]]], "name": "conv1d_25"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_13"}, "inbound_nodes": [[["dropout_12", 0, 0, {}], ["conv1d_25", 0, 0, {}]]], "name": "add_13"}, {"class_name": "Dropout", "config": {"name": "dropout_13", "dtype": "float32", "trainable": true, "rate": 0.020166839016, "seed": null, "noise_shape": null}, "inbound_nodes": [[["add_13", 0, 0, {}]]], "name": "dropout_13"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_8_tanh_s1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [8], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_13", 0, 0, {}]]], "name": "dilated_conv_8_tanh_s1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_8_sigm_s1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [8], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_13", 0, 0, {}]]], "name": "dilated_conv_8_sigm_s1"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "gated_activation_3_s1"}, "inbound_nodes": [[["dilated_conv_8_tanh_s1", 0, 0, {}], ["dilated_conv_8_sigm_s1", 0, 0, {}]]], "name": "gated_activation_3_s1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_27", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_3_s1", 0, 0, {}]]], "name": "conv1d_27"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_14"}, "inbound_nodes": [[["dropout_13", 0, 0, {}], ["conv1d_27", 0, 0, {}]]], "name": "add_14"}, {"class_name": "Dropout", "config": {"name": "dropout_14", "dtype": "float32", "trainable": true, "rate": 0.020166839016, "seed": null, "noise_shape": null}, "inbound_nodes": [[["add_14", 0, 0, {}]]], "name": "dropout_14"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_16_tanh_s1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [16], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_14", 0, 0, {}]]], "name": "dilated_conv_16_tanh_s1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_16_sigm_s1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [16], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_14", 0, 0, {}]]], "name": "dilated_conv_16_sigm_s1"}, {"class_name": "Multiply", "config": {"dtype": "float32", "trainable": true, "name": "gated_activation_4_s1"}, "inbound_nodes": [[["dilated_conv_16_tanh_s1", 0, 0, {}], ["dilated_conv_16_sigm_s1", 0, 0, {}]]], "name": "gated_activation_4_s1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_29", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["gated_activation_4_s1", 0, 0, {}]]], "name": "conv1d_29"}, {"class_name": "Add", "config": {"dtype": "float32", "trainable": true, "name": "add_15"}, "inbound_nodes": [[["dropout_14", 0, 0, {}], ["conv1d_29", 0, 0, {}]]], "name": "add_15"}, {"class_name": "Dropout", "config": {"name": "dropout_15", "dtype": "float32", "trainable": true, "rate": 0.020166839016, "seed": null, "noise_shape": null}, "inbound_nodes": [[["add_15", 0, 0, {}]]], "name": "dropout_15"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_32_tanh_s1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", "strides": [1], "dilation_rate": [32], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 2.9891174563090317e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["dropout_15", 0, 0, {}]]], "name": "dilated_conv_32_tanh_s1"}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dilated_conv_32_sigm_s1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "data_format": "channels_last", "filters": 2, "padding": "same", 